{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "elevate_emotion_mlp",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              1764
            ],
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "batch_input_shape": [
              null,
              512
            ],
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "batch_input_shape": [
              null,
              128
            ],
            "dtype": "float32",
            "units": 7,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "train_emotion_fast.py (Elevate)",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            1764,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            512,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            128,
            7
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            7
          ],
          "dtype": "float32"
        },
        {
          "name": "scaler/mean",
          "shape": [
            1764
          ],
          "dtype": "float32"
        },
        {
          "name": "scaler/std",
          "shape": [
            1764
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "elevate_meta": {
    "class_names": [
      "happy",
      "bored",
      "focused",
      "confused",
      "neutral",
      "angry",
      "surprised"
    ],
    "img_size": 48,
    "hog_orientations": 9,
    "hog_pixels_per_cell": [
      6,
      6
    ],
    "hog_cells_per_block": [
      2,
      2
    ],
    "feature_dim": 1764,
    "class_balance_weights": {
      "happy": 1.0827,
      "bored": 0.78,
      "focused": 0.78,
      "confused": 0.8474,
      "neutral": 1.32,
      "angry": 1.32,
      "surprised": 0.9599
    },
    "class_prior_multipliers": {
      "happy": 0.9998,
      "bored": 0.9998,
      "focused": 0.9998,
      "confused": 1.0013,
      "neutral": 0.9998,
      "angry": 0.9998,
      "surprised": 0.9998
    },
    "architecture": "HOG(48x48) \u2192 Dense(512,relu) \u2192 Dense(128,relu) \u2192 Dense(7,softmax)",
    "normalisation": "StandardScaler (zero-mean, unit-variance) \u2014 weights at scaler/mean and scaler/std",
    "scaler_mean": [
      0.2472718507051468,
      0.12820829451084137,
      0.09368933737277985,
      0.05730127915740013,
      0.116500124335289,
      0.029826179146766663,
      0.029317915439605713,
      0.04100513830780983,
      0.09061398357152939,
      0.26019811630249023,
      0.15997454524040222,
      0.1530270129442215,
      0.100514255464077,
      0.07820013165473938,
      0.03700610622763634,
      0.033842429518699646,
      0.04226784035563469,
      0.09913831949234009,
      0.2526281774044037,
      0.1618863046169281,
      0.09446193277835846,
      0.054321032017469406,
      0.11759644746780396,
      0.035367514938116074,
      0.04190120846033096,
      0.06165251508355141,
      0.14032086730003357,
      0.24325770139694214,
      0.16559232771396637,
      0.13638608157634735,
      0.09727571904659271,
      0.07960103452205658,
      0.0588202141225338,
      0.05369548127055168,
      0.06315846741199493,
      0.13964509963989258,
      0.2640973627567291,
      0.15357711911201477,
      0.1481878161430359,
      0.09775522351264954,
      0.07520310580730438,
      0.03707946836948395,
      0.03354879468679428,
      0.0427989698946476,
      0.08179201185703278,
      0.21894805133342743,
      0.10758061707019806,
      0.13601908087730408,
      0.12311824411153793,
      0.10500795394182205,
      0.05275162681937218,
      0.039957743138074875,
      0.03767712041735649,
      0.04577403515577316,
      0.2474256455898285,
      0.16089162230491638,
      0.13271091878414154,
      0.09576810896396637,
      0.08020491153001785,
      0.059787362813949585,
      0.054243046790361404,
      0.06451953947544098,
      0.12339818477630615,
      0.1818184107542038,
      0.12607704102993011,
      0.103533074259758,
      0.11197253316640854,
      0.12429016083478928,
      0.10251700133085251,
      0.07626373320817947,
      0.061166997998952866,
      0.07232493907213211,
      0.22845569252967834,
      0.11591366678476334,
      0.144308939576149,
      0.13062672317028046,
      0.109904944896698,
      0.060073528438806534,
      0.04585207998752594,
      0.04399671033024788,
      0.05211377888917923,
      0.1701597273349762,
      0.12120692431926727,
      0.12214383482933044,
      0.13250267505645752,
      0.1347789764404297,
      0.09688125550746918,
      0.07569243013858795,
      0.054567188024520874,
      0.04144686087965965,
      0.17881017923355103,
      0.12939812242984772,
      0.11420933902263641,
      0.12460983544588089,
      0.13850565254688263,
      0.11606111377477646,
      0.088380828499794,
      0.07287268340587616,
      0.08073011040687561,
      0.15463535487651825,
      0.15012384951114655,
      0.1106676384806633,
      0.11935370415449142,
      0.13702210783958435,
      0.12706351280212402,
      0.10466419160366058,
      0.0994827151298523,
      0.08938147127628326,
      0.17605137825012207,
      0.11590690165758133,
      0.12504522502422333,
      0.1381336748600006,
      0.13978761434555054,
      0.10315089672803879,
      0.0804617628455162,
      0.059094641357660294,
      0.0454716831445694,
      0.16519474983215332,
      0.06562009453773499,
      0.08936461061239243,
      0.11358049511909485,
      0.1470511555671692,
      0.14492660760879517,
      0.13062576949596405,
      0.11373553425073624,
      0.060026295483112335,
      0.14620643854141235,
      0.13815903663635254,
      0.1151818111538887,
      0.1274864226579666,
      0.1453276425600052,
      0.1348935067653656,
      0.11335893720388412,
      0.10583901405334473,
      0.09346657246351242,
      0.11550983041524887,
      0.1184348315000534,
      0.12017921358346939,
      0.14087167382240295,
      0.15179875493049622,
      0.1340184062719345,
      0.1212250143289566,
      0.13455446064472198,
      0.13097721338272095,
      0.1546211689710617,
      0.06048699840903282,
      0.08481873571872711,
      0.1086200401186943,
      0.14297400414943695,
      0.1411854326725006,
      0.1285857856273651,
      0.11283895373344421,
      0.05691244825720787,
      0.18159204721450806,
      0.042733680456876755,
      0.04587184637784958,
      0.06145213544368744,
      0.11001358926296234,
      0.12774866819381714,
      0.14548170566558838,
      0.12642553448677063,
      0.11142469197511673,
      0.1108463779091835,
      0.1128736287355423,
      0.11158420890569687,
      0.1329646110534668,
      0.1435001790523529,
      0.1258688122034073,
      0.11665953695774078,
      0.13853324949741364,
      0.13346216082572937,
      0.10358800739049911,
      0.07334142178297043,
      0.09265905618667603,
      0.12295112013816833,
      0.14033445715904236,
      0.12275227904319763,
      0.1150137186050415,
      0.143901526927948,
      0.15393546223640442,
      0.16762515902519226,
      0.036842964589595795,
      0.04057407006621361,
      0.054499492049217224,
      0.10685868561267853,
      0.12031234055757523,
      0.13935041427612305,
      0.12139267474412918,
      0.10582245141267776,
      0.22171491384506226,
      0.038903236389160156,
      0.033273711800575256,
      0.0383758470416069,
      0.08020465821027756,
      0.09910756349563599,
      0.1455865204334259,
      0.14866529405117035,
      0.17003732919692993,
      0.09753192216157913,
      0.06276954710483551,
      0.08082027733325958,
      0.1097462922334671,
      0.12710189819335938,
      0.1119982898235321,
      0.10561253875494003,
      0.14620068669319153,
      0.16073283553123474,
      0.13387277722358704,
      0.06038759648799896,
      0.05428874492645264,
      0.06489263474941254,
      0.08744453638792038,
      0.0971410721540451,
      0.12993647158145905,
      0.15880261361598969,
      0.21609915792942047,
      0.219644233584404,
      0.03840145468711853,
      0.03328830003738403,
      0.037930987775325775,
      0.08378668874502182,
      0.10140730440616608,
      0.14976085722446442,
      0.1541920155286789,
      0.1713031828403473,
      0.20677408576011658,
      0.046106208115816116,
      0.03056095540523529,
      0.02905457280576229,
      0.12329012155532837,
      0.06136681139469147,
      0.09897562116384506,
      0.1299063265323639,
      0.16741031408309937,
      0.14209207892417908,
      0.059094857424497604,
      0.053499311208724976,
      0.06358426064252853,
      0.08689741045236588,
      0.09772611409425735,
      0.1327783614397049,
      0.16210947930812836,
      0.21339477598667145,
      0.16858825087547302,
      0.05796925351023674,
      0.03947069123387337,
      0.03583608940243721,
      0.12513412535190582,
      0.0578855536878109,
      0.09993273764848709,
      0.16410575807094574,
      0.2255464792251587,
      0.2421526312828064,
      0.1494309902191162,
      0.08617934584617615,
      0.04885603114962578,
      0.10822609066963196,
      0.03172526881098747,
      0.03815675526857376,
      0.056670110672712326,
      0.1313968300819397,
      0.2322268784046173,
      0.15384911000728607,
      0.1253999024629593,
      0.08822622895240784,
      0.07096040993928909,
      0.05259152874350548,
      0.04832896962761879,
      0.0576561875641346,
      0.13123758137226105,
      0.2532130777835846,
      0.14235949516296387,
      0.07626598328351974,
      0.04797134920954704,
      0.11695083975791931,
      0.03904370218515396,
      0.04775073751807213,
      0.07685595005750656,
      0.1536385864019394,
      0.24011699855327606,
      0.14922411739826202,
      0.13899977505207062,
      0.12866069376468658,
      0.11460017412900925,
      0.08520377427339554,
      0.07155194133520126,
      0.07817242294549942,
      0.14757506549358368,
      0.2268301397562027,
      0.140939861536026,
      0.1163087859749794,
      0.08217952400445938,
      0.06551418453454971,
      0.049095358699560165,
      0.04422466829419136,
      0.0534064806997776,
      0.10952864587306976,
      0.1686021238565445,
      0.11070705950260162,
      0.08909402787685394,
      0.09500065445899963,
      0.10511235892772675,
      0.0869130864739418,
      0.06335445493459702,
      0.050475116819143295,
      0.06347227841615677,
      0.22992299497127533,
      0.13703222572803497,
      0.13111093640327454,
      0.12288853526115417,
      0.10867145657539368,
      0.08098943531513214,
      0.06703485548496246,
      0.07233236730098724,
      0.1247941330075264,
      0.17558376491069794,
      0.10198131203651428,
      0.11544249206781387,
      0.14583992958068848,
      0.17011867463588715,
      0.156012624502182,
      0.11919295787811279,
      0.08395329117774963,
      0.09487514942884445,
      0.1556563377380371,
      0.10844841599464417,
      0.09181410074234009,
      0.10014253109693527,
      0.111235111951828,
      0.09297328442335129,
      0.06825333088636398,
      0.05429331585764885,
      0.06430318206548691,
      0.13459819555282593,
      0.13125315308570862,
      0.09068018943071365,
      0.09701181203126907,
      0.11100459843873978,
      0.10280883312225342,
      0.08367182314395905,
      0.08146459609270096,
      0.07282821834087372,
      0.16069379448890686,
      0.10234253108501434,
      0.12164042145013809,
      0.15355373919010162,
      0.17733709514141083,
      0.16420209407806396,
      0.1280030459165573,
      0.0912022814154625,
      0.09390623867511749,
      0.16834035515785217,
      0.12601681053638458,
      0.10447961837053299,
      0.11502079665660858,
      0.12944090366363525,
      0.14309217035770416,
      0.14996865391731262,
      0.1459711492061615,
      0.13496620953083038,
      0.13032065331935883,
      0.12433995306491852,
      0.09424815326929092,
      0.10267143696546555,
      0.11675319075584412,
      0.1092071607708931,
      0.09125620126724243,
      0.08704183995723724,
      0.0761823058128357,
      0.09406756609678268,
      0.10015972703695297,
      0.09764153510332108,
      0.11547321826219559,
      0.12258585542440414,
      0.10789786279201508,
      0.09887776523828506,
      0.118223175406456,
      0.11757287383079529,
      0.16562168300151825,
      0.1263212114572525,
      0.10845668613910675,
      0.12007433921098709,
      0.13588644564151764,
      0.14865705370903015,
      0.15505163371562958,
      0.15329372882843018,
      0.1437063217163086,
      0.16078105568885803,
      0.1630239635705948,
      0.15810710191726685,
      0.14844927191734314,
      0.13645689189434052,
      0.1195719987154007,
      0.11221500486135483,
      0.1266309767961502,
      0.15360127389431,
      0.08992716670036316,
      0.09526032209396362,
      0.0901760533452034,
      0.10853347927331924,
      0.1160271018743515,
      0.10170017182826996,
      0.09526734054088593,
      0.12119556218385696,
      0.11871429532766342,
      0.08375954627990723,
      0.05517866089940071,
      0.07188839465379715,
      0.09918716549873352,
      0.11051706969738007,
      0.09665078669786453,
      0.092009536921978,
      0.12398706376552582,
      0.1388508379459381,
      0.1528361737728119,
      0.15554553270339966,
      0.15168195962905884,
      0.14187948405742645,
      0.1296699047088623,
      0.11388126015663147,
      0.10747146606445312,
      0.124868243932724,
      0.1526174545288086,
      0.12152427434921265,
      0.09824836254119873,
      0.13212266564369202,
      0.16433829069137573,
      0.17331859469413757,
      0.14822277426719666,
      0.1233014389872551,
      0.11155260354280472,
      0.15368860960006714,
      0.08577364683151245,
      0.05156887695193291,
      0.06678371876478195,
      0.09298007935285568,
      0.10598917305469513,
      0.09272930771112442,
      0.08956460654735565,
      0.13062815368175507,
      0.15321077406406403,
      0.11940140277147293,
      0.04935019835829735,
      0.04394923895597458,
      0.052767492830753326,
      0.07069274038076401,
      0.08246330171823502,
      0.11339863389730453,
      0.13907799124717712,
      0.2023034393787384,
      0.12535624206066132,
      0.09151344001293182,
      0.12456779181957245,
      0.15699128806591034,
      0.16675709187984467,
      0.141654834151268,
      0.11803091317415237,
      0.11259187757968903,
      0.16996704041957855,
      0.13152623176574707,
      0.06865803897380829,
      0.06824666261672974,
      0.08521238714456558,
      0.11281886696815491,
      0.12189825624227524,
      0.12817831337451935,
      0.1349826604127884,
      0.20869705080986023,
      0.13483302295207977,
      0.05369962006807327,
      0.04791322723031044,
      0.05657967925071716,
      0.07729288935661316,
      0.08841701596975327,
      0.12245538085699081,
      0.15146397054195404,
      0.21068252623081207,
      0.15971863269805908,
      0.053065598011016846,
      0.03551655262708664,
      0.03187026083469391,
      0.11445090919733047,
      0.05164514109492302,
      0.09124588966369629,
      0.15270115435123444,
      0.22382603585720062,
      0.1528964787721634,
      0.07473702728748322,
      0.07308146357536316,
      0.0896344855427742,
      0.11920629441738129,
      0.1277557611465454,
      0.1372181624174118,
      0.14665615558624268,
      0.22326591610908508,
      0.16974741220474243,
      0.06996915489435196,
      0.04690872132778168,
      0.04147869348526001,
      0.12624551355838776,
      0.052045371383428574,
      0.07889869809150696,
      0.1404268592596054,
      0.23356947302818298,
      0.24787242710590363,
      0.1364475041627884,
      0.07244586944580078,
      0.04513648897409439,
      0.11269272863864899,
      0.037135008722543716,
      0.04573792591691017,
      0.07389695942401886,
      0.150968536734581,
      0.23571796715259552,
      0.14381025731563568,
      0.13282909989356995,
      0.12244994938373566,
      0.10875894129276276,
      0.08166275173425674,
      0.06934908032417297,
      0.07634741067886353,
      0.1428871899843216,
      0.2448480725288391,
      0.112804114818573,
      0.054620541632175446,
      0.04129655659198761,
      0.11270139366388321,
      0.04037368297576904,
      0.05655120685696602,
      0.09015684574842453,
      0.17117777466773987,
      0.2301187664270401,
      0.11037366092205048,
      0.09264203906059265,
      0.09051931649446487,
      0.10248275101184845,
      0.09937723726034164,
      0.09303945302963257,
      0.09684519469738007,
      0.17201770842075348,
      0.21593645215034485,
      0.12479642033576965,
      0.1184433251619339,
      0.11014620214700699,
      0.0979498103260994,
      0.07300109416246414,
      0.06139768660068512,
      0.06723407655954361,
      0.11758735030889511,
      0.16852933168411255,
      0.09613305330276489,
      0.10747738182544708,
      0.1334107667207718,
      0.15542009472846985,
      0.1414961963891983,
      0.10854625701904297,
      0.07731027156114578,
      0.09016816318035126,
      0.21486014127731323,
      0.0957714095711708,
      0.08120608329772949,
      0.0798143744468689,
      0.08995766937732697,
      0.08874392509460449,
      0.08236384391784668,
      0.08555632829666138,
      0.14087611436843872,
      0.18394432961940765,
      0.10821457207202911,
      0.11849822849035263,
      0.1360948085784912,
      0.14402912557125092,
      0.12099352478981018,
      0.09616293013095856,
      0.08744212239980698,
      0.13355077803134918,
      0.15159641206264496,
      0.09219001233577728,
      0.1067446768283844,
      0.13424599170684814,
      0.15636004507541656,
      0.14329783618450165,
      0.1108335331082344,
      0.07891913503408432,
      0.08519136905670166,
      0.15399950742721558,
      0.1144285500049591,
      0.09448888897895813,
      0.10075856000185013,
      0.11263293772935867,
      0.12233918160200119,
      0.12941859662532806,
      0.1275254487991333,
      0.12051878124475479,
      0.16847741603851318,
      0.10739821195602417,
      0.12020368129014969,
      0.13840307295322418,
      0.14520247280597687,
      0.12318581342697144,
      0.09694850444793701,
      0.08724988996982574,
      0.1197732612490654,
      0.20245957374572754,
      0.14027412235736847,
      0.1176309734582901,
      0.10115423053503036,
      0.08983456343412399,
      0.08150321990251541,
      0.08672388643026352,
      0.13293597102165222,
      0.18591733276844025,
      0.1523110568523407,
      0.11592540889978409,
      0.09726026654243469,
      0.10431213676929474,
      0.11793746799230576,
      0.12903577089309692,
      0.1359143853187561,
      0.13457167148590088,
      0.12784205377101898,
      0.14383269846439362,
      0.14462949335575104,
      0.13875608146190643,
      0.12897665798664093,
      0.11834992468357086,
      0.10423190146684647,
      0.10017333179712296,
      0.11505584418773651,
      0.14035266637802124,
      0.20351333916187286,
      0.1484191119670868,
      0.1252194494009018,
      0.1086185872554779,
      0.095538429915905,
      0.08625921607017517,
      0.09145207703113556,
      0.13717947900295258,
      0.18368658423423767,
      0.187648743391037,
      0.13786737620830536,
      0.09166692942380905,
      0.08655016124248505,
      0.09672064334154129,
      0.10705384612083435,
      0.12367807328701019,
      0.14868520200252533,
      0.18782806396484375,
      0.13833434879779816,
      0.1389346718788147,
      0.13253746926784515,
      0.12300129979848862,
      0.11375003308057785,
      0.10077554732561111,
      0.0975625291466713,
      0.11362797021865845,
      0.1412438154220581,
      0.11215951293706894,
      0.08612304925918579,
      0.11591172218322754,
      0.14458779990673065,
      0.15359622240066528,
      0.13052523136138916,
      0.10923827439546585,
      0.10208063572645187,
      0.14870744943618774,
      0.1881333291530609,
      0.1350470334291458,
      0.08792322874069214,
      0.08228795230388641,
      0.09143200516700745,
      0.10005684942007065,
      0.11651822179555893,
      0.14145226776599884,
      0.1853066086769104,
      0.1393578052520752,
      0.09199311584234238,
      0.09541701525449753,
      0.11971356719732285,
      0.14056509733200073,
      0.1330733746290207,
      0.11481112986803055,
      0.10667385905981064,
      0.1587131768465042,
      0.11976764351129532,
      0.0849953144788742,
      0.11447393894195557,
      0.1437327265739441,
      0.15363357961177826,
      0.1307944506406784,
      0.11024157702922821,
      0.10655391961336136,
      0.1651335507631302,
      0.1249304860830307,
      0.06393375992774963,
      0.06323394179344177,
      0.07756684720516205,
      0.1021878644824028,
      0.10980498045682907,
      0.11671945452690125,
      0.12361118197441101,
      0.19870856404304504,
      0.1492871344089508,
      0.09329624474048615,
      0.09513057768344879,
      0.11805175989866257,
      0.1393829733133316,
      0.1307210475206375,
      0.11301866173744202,
      0.10700633376836777,
      0.17476516962051392,
      0.15329566597938538,
      0.08078394085168839,
      0.08149195462465286,
      0.08956076204776764,
      0.09159067273139954,
      0.0786227285861969,
      0.07887765020132065,
      0.0947524681687355,
      0.1969897747039795,
      0.14982633292675018,
      0.07287901639938354,
      0.07117289304733276,
      0.08630920946598053,
      0.11316921561956406,
      0.12214459478855133,
      0.1316712647676468,
      0.14178018271923065,
      0.22010865807533264,
      0.16733035445213318,
      0.06783971190452576,
      0.04503844678401947,
      0.039219632744789124,
      0.1211833506822586,
      0.04909611493349075,
      0.07529740780591965,
      0.13574492931365967,
      0.23002168536186218,
      0.18144609034061432,
      0.0921010747551918,
      0.0918356403708458,
      0.1002378761768341,
      0.10409224033355713,
      0.08908417820930481,
      0.08997911214828491,
      0.10875911265611649,
      0.21236996352672577,
      0.19340410828590393,
      0.08786766231060028,
      0.05572247505187988,
      0.04202582314610481,
      0.11733460426330566,
      0.04284369572997093,
      0.057658761739730835,
      0.11172477155923843,
      0.22835347056388855,
      0.2537425458431244,
      0.11709129065275192,
      0.058514270931482315,
      0.0443391390144825,
      0.12024181336164474,
      0.04490828886628151,
      0.06181873753666878,
      0.09735793620347977,
      0.18035385012626648,
      0.24048683047294617,
      0.1170269176363945,
      0.09825245290994644,
      0.09681619703769684,
      0.10983071476221085,
      0.10839405655860901,
      0.10219153016805649,
      0.10579406470060349,
      0.1766156554222107,
      0.22684016823768616,
      0.08059881627559662,
      0.05048447474837303,
      0.03978724405169487,
      0.12260722368955612,
      0.0420648530125618,
      0.070900559425354,
      0.12112417072057724,
      0.17877206206321716,
      0.20531484484672546,
      0.08107498288154602,
      0.06905443966388702,
      0.06356825679540634,
      0.06313453614711761,
      0.06366461515426636,
      0.08598117530345917,
      0.12619635462760925,
      0.19063575565814972,
      0.22191905975341797,
      0.10833406448364258,
      0.09258180856704712,
      0.09208104759454727,
      0.10433454066514969,
      0.10426633805036545,
      0.09713533520698547,
      0.1002637967467308,
      0.15519769489765167,
      0.1882314682006836,
      0.12195410579442978,
      0.13431963324546814,
      0.15259282290935516,
      0.15978947281837463,
      0.13779470324516296,
      0.11112567037343979,
      0.10010233521461487,
      0.14417710900306702,
      0.19114291667938232,
      0.0746709555387497,
      0.06481901556253433,
      0.06008564680814743,
      0.05976510047912598,
      0.06028361991047859,
      0.08282000571489334,
      0.12012334167957306,
      0.17088131606578827,
      0.17191630601882935,
      0.12954655289649963,
      0.11703226715326309,
      0.09800145775079727,
      0.08664775639772415,
      0.07379170507192612,
      0.07331399619579315,
      0.08255582302808762,
      0.14011037349700928,
      0.16847378015518188,
      0.1158028170466423,
      0.12877632677555084,
      0.1461174041032791,
      0.15183357894420624,
      0.13301585614681244,
      0.10711934417486191,
      0.09590569138526917,
      0.12607194483280182,
      0.20537900924682617,
      0.15039591491222382,
      0.1275978535413742,
      0.11093375831842422,
      0.0978044793009758,
      0.08860950917005539,
      0.09336993843317032,
      0.13998039066791534,
      0.18829631805419922,
      0.1519419252872467,
      0.1165677160024643,
      0.11037467420101166,
      0.094260573387146,
      0.08337383717298508,
      0.07047499716281891,
      0.06951693445444107,
      0.07685595005750656,
      0.12423116713762283,
      0.18007655441761017,
      0.15401475131511688,
      0.12061160057783127,
      0.11028613150119781,
      0.11431243270635605,
      0.10640949010848999,
      0.11476238816976547,
      0.15505890548229218,
      0.15702572464942932,
      0.19765816628932953,
      0.148387148976326,
      0.125562846660614,
      0.108309805393219,
      0.09588513523340225,
      0.08746911585330963,
      0.09267713129520416,
      0.13642756640911102,
      0.17886096239089966,
      0.1833687424659729,
      0.13687999546527863,
      0.09271059185266495,
      0.08752778172492981,
      0.09680820256471634,
      0.10689238458871841,
      0.12412885576486588,
      0.1486743539571762,
      0.18366506695747375,
      0.1746831089258194,
      0.15045715868473053,
      0.1171705573797226,
      0.10695523023605347,
      0.11095155775547028,
      0.10346990078687668,
      0.11181385070085526,
      0.14715442061424255,
      0.15145134925842285,
      0.15827278792858124,
      0.14985981583595276,
      0.1162930503487587,
      0.10864940285682678,
      0.11727223545312881,
      0.10947604477405548,
      0.12235160171985626,
      0.14492428302764893,
      0.153947114944458,
      0.19529663026332855,
      0.1431017369031906,
      0.09502296149730682,
      0.08962235599756241,
      0.09975302964448929,
      0.1103857085108757,
      0.12730802595615387,
      0.15239973366260529,
      0.19199354946613312,
      0.14640957117080688,
      0.10072408616542816,
      0.10593526065349579,
      0.12932774424552917,
      0.14751332998275757,
      0.14141209423542023,
      0.12335601449012756,
      0.11519141495227814,
      0.16323450207710266,
      0.16492123901844025,
      0.16026543080806732,
      0.12082255631685257,
      0.11214245855808258,
      0.12167415022850037,
      0.1133333072066307,
      0.12667427957057953,
      0.14927582442760468,
      0.15947355329990387,
      0.12777292728424072,
      0.07997972518205643,
      0.06978148967027664,
      0.06991101801395416,
      0.0830124244093895,
      0.09376463294029236,
      0.11031197756528854,
      0.11583216488361359,
      0.14512576162815094,
      0.16226455569267273,
      0.106427401304245,
      0.1106453388929367,
      0.13506962358951569,
      0.1555226743221283,
      0.14822997152805328,
      0.12908700108528137,
      0.12128595262765884,
      0.18235152959823608,
      0.17023615539073944,
      0.09564555436372757,
      0.09690552949905396,
      0.10552337765693665,
      0.10601504892110825,
      0.09094570577144623,
      0.09042948484420776,
      0.10721342265605927,
      0.20649057626724243,
      0.14248307049274445,
      0.08634676039218903,
      0.0744929164648056,
      0.07412395626306534,
      0.08749886602163315,
      0.09880942851305008,
      0.11735536903142929,
      0.12665607035160065,
      0.16321861743927002,
      0.19029150903224945,
      0.11272753775119781,
      0.07864315807819366,
      0.060728516429662704,
      0.061914898455142975,
      0.06247740238904953,
      0.0679791048169136,
      0.0755685567855835,
      0.1711360067129135,
      0.18799135088920593,
      0.10098081827163696,
      0.10177559405565262,
      0.11023670434951782,
      0.11180276423692703,
      0.09603514522314072,
      0.096054308116436,
      0.11558262258768082,
      0.2215375453233719,
      0.20317764580249786,
      0.0964832454919815,
      0.06210877373814583,
      0.04745660722255707,
      0.1259172260761261,
      0.04623519256711006,
      0.06202665716409683,
      0.11691724509000778,
      0.2358880490064621,
      0.20787708461284637,
      0.11910711228847504,
      0.08208434283733368,
      0.06427405029535294,
      0.06560737639665604,
      0.06682171672582626,
      0.07260332256555557,
      0.08121305704116821,
      0.18129771947860718,
      0.19561569392681122,
      0.1169264167547226,
      0.06801954656839371,
      0.043184440582990646,
      0.12245749682188034,
      0.04041221737861633,
      0.0509771853685379,
      0.08194570988416672,
      0.20745223760604858,
      0.22842612862586975,
      0.08361537754535675,
      0.052610382437705994,
      0.04207780584692955,
      0.1292765587568283,
      0.0454978384077549,
      0.07599761337041855,
      0.12968558073043823,
      0.1870334893465042,
      0.2110835462808609,
      0.08445730805397034,
      0.07251130789518356,
      0.06832452863454819,
      0.06894470751285553,
      0.06900995224714279,
      0.09357158094644547,
      0.1356312781572342,
      0.19718095660209656,
      0.2085108906030655,
      0.07432538270950317,
      0.04988664761185646,
      0.04352381080389023,
      0.12766417860984802,
      0.049505263566970825,
      0.08236284554004669,
      0.1348072588443756,
      0.17985212802886963,
      0.1963798850774765,
      0.0956282839179039,
      0.05874542146921158,
      0.055048439651727676,
      0.058269914239645004,
      0.06694743037223816,
      0.1059126928448677,
      0.1635611206293106,
      0.21687544882297516,
      0.19727572798728943,
      0.08245629072189331,
      0.07149423658847809,
      0.06777600198984146,
      0.06862941384315491,
      0.06966923177242279,
      0.09495791047811508,
      0.13589006662368774,
      0.18708999454975128,
      0.17633938789367676,
      0.1401202380657196,
      0.12953920662403107,
      0.11205153167247772,
      0.09934849292039871,
      0.08425450325012207,
      0.08256353437900543,
      0.0918295830488205,
      0.14431503415107727,
      0.18273888528347015,
      0.09289553016424179,
      0.05735329911112785,
      0.054141491651535034,
      0.05739876627922058,
      0.06898041814565659,
      0.10899318754673004,
      0.16117385029792786,
      0.2004942148923874,
      0.17338739335536957,
      0.1687731295824051,
      0.12086135894060135,
      0.0994318276643753,
      0.10168121010065079,
      0.10516192764043808,
      0.11491800844669342,
      0.12290199846029282,
      0.15879032015800476,
      0.1573178768157959,
      0.12436377257108688,
      0.11621261388063431,
      0.09987731277942657,
      0.08860192447900772,
      0.07522543519735336,
      0.07431664317846298,
      0.083183653652668,
      0.13036267459392548,
      0.18980883061885834,
      0.16584621369838715,
      0.1317015141248703,
      0.11852425336837769,
      0.12310925126075745,
      0.1140955314040184,
      0.12576578557491302,
      0.16453886032104492,
      0.1676906794309616,
      0.1558942347764969,
      0.15168148279190063,
      0.10850770026445389,
      0.08855920284986496,
      0.09292149543762207,
      0.09631512314081192,
      0.10475379973649979,
      0.11141235381364822,
      0.1424284130334854,
      0.1333017498254776,
      0.11248782277107239,
      0.11815469712018967,
      0.14479069411754608,
      0.1631387174129486,
      0.15422654151916504,
      0.1358005851507187,
      0.11473417282104492,
      0.11651069670915604,
      0.1762915402650833,
      0.15445511043071747,
      0.11989928036928177,
      0.10680573433637619,
      0.11256558448076248,
      0.10516750067472458,
      0.11830516159534454,
      0.15340998768806458,
      0.15607573091983795,
      0.16415606439113617,
      0.15652814507484436,
      0.12465180456638336,
      0.11189359426498413,
      0.12135272473096848,
      0.11123809963464737,
      0.12722182273864746,
      0.14900077879428864,
      0.1569453775882721,
      0.12389805912971497,
      0.1047697365283966,
      0.10765033215284348,
      0.1343350112438202,
      0.1533416509628296,
      0.14455674588680267,
      0.12676987051963806,
      0.10722371935844421,
      0.11148986965417862,
      0.12000593543052673,
      0.11076206713914871,
      0.13336335122585297,
      0.15089857578277588,
      0.1553633064031601,
      0.1328551173210144,
      0.10554701089859009,
      0.09938206523656845,
      0.10415748506784439,
      0.17716878652572632,
      0.17070405185222626,
      0.13372839987277985,
      0.12083672732114792,
      0.1321692168712616,
      0.12257527559995651,
      0.13980737328529358,
      0.16114424169063568,
      0.1704835742712021,
      0.13855016231536865,
      0.08626662194728851,
      0.07408420741558075,
      0.0738564059138298,
      0.08713532239198685,
      0.09830941259860992,
      0.11502987146377563,
      0.12216363847255707,
      0.15011131763458252,
      0.1282760202884674,
      0.11913198232650757,
      0.14231155812740326,
      0.16052408516407013,
      0.16483750939369202,
      0.14311707019805908,
      0.11563310772180557,
      0.10750334709882736,
      0.1135416179895401,
      0.14316508173942566,
      0.11069366335868835,
      0.10203917324542999,
      0.09694971889257431,
      0.09589572250843048,
      0.09114156663417816,
      0.11237795650959015,
      0.15314021706581116,
      0.14373444020748138,
      0.15118901431560516,
      0.09483285993337631,
      0.0825481191277504,
      0.0834752544760704,
      0.09853006899356842,
      0.11121567338705063,
      0.12924203276634216,
      0.13712617754936218,
      0.16595040261745453,
      0.20609863102436066,
      0.12672246992588043,
      0.08999399095773697,
      0.0696140006184578,
      0.06979459524154663,
      0.06934279203414917,
      0.07403920590877533,
      0.0827651172876358,
      0.17543156445026398,
      0.15843109786510468,
      0.12276096642017365,
      0.1124841645359993,
      0.10650024563074112,
      0.10611186176538467,
      0.10265151411294937,
      0.12455382198095322,
      0.16782626509666443,
      0.15690387785434723,
      0.21862639486789703,
      0.15223871171474457,
      0.10384871065616608,
      0.07061700522899628,
      0.059635866433382034,
      0.05875513702630997,
      0.0637994036078453,
      0.11892800778150558,
      0.16778096556663513,
      0.21126055717468262,
      0.12709295749664307,
      0.08895742148160934,
      0.06913245469331741,
      0.07066160440444946,
      0.07121764123439789,
      0.07546548545360565,
      0.0839037075638771,
      0.18545228242874146,
      0.20241811871528625,
      0.12500910460948944,
      0.0729159414768219,
      0.04624821990728378,
      0.12821994721889496,
      0.04203376546502113,
      0.05280134826898575,
      0.08338338881731033,
      0.20734556019306183,
      0.22341088950634003,
      0.15448199212551117,
      0.10204917192459106,
      0.06901534646749496,
      0.060942456126213074,
      0.06091587245464325,
      0.06570475548505783,
      0.12343478947877884,
      0.1785803586244583,
      0.1972946971654892,
      0.1326596438884735,
      0.08306093513965607,
      0.04991203173995018,
      0.1309235841035843,
      0.04728316143155098,
      0.05168543756008148,
      0.07090667635202408,
      0.19068585336208344,
      0.20278583467006683,
      0.0739196389913559,
      0.04899737983942032,
      0.042610932141542435,
      0.12617695331573486,
      0.04845913499593735,
      0.08194760978221893,
      0.13580217957496643,
      0.179793581366539,
      0.19321464002132416,
      0.09306537359952927,
      0.05752013623714447,
      0.05397374555468559,
      0.05770905315876007,
      0.06666190177202225,
      0.1067562997341156,
      0.16523440182209015,
      0.21624155342578888,
      0.18201854825019836,
      0.07927986234426498,
      0.05438145995140076,
      0.04751818627119064,
      0.12831652164459229,
      0.05614246055483818,
      0.09130776673555374,
      0.12441694736480713,
      0.15551096200942993,
      0.18777406215667725,
      0.08023291826248169,
      0.06078336387872696,
      0.05744617432355881,
      0.06387709826231003,
      0.07922185212373734,
      0.13148152828216553,
      0.1849857121706009,
      0.21365614235401154,
      0.17504233121871948,
      0.09026775509119034,
      0.05379125103354454,
      0.05039307102560997,
      0.05295446887612343,
      0.06348243355751038,
      0.10285725444555283,
      0.15650947391986847,
      0.19551560282707214,
      0.1681879758834839,
      0.16176678240299225,
      0.11465027928352356,
      0.093001589179039,
      0.0963684692978859,
      0.09993703663349152,
      0.10978850722312927,
      0.11786884069442749,
      0.15208977460861206,
      0.1714390367269516,
      0.07912734150886536,
      0.05691909417510033,
      0.052681319415569305,
      0.06063814088702202,
      0.07744448632001877,
      0.1261122226715088,
      0.1724076271057129,
      0.19723689556121826,
      0.16280607879161835,
      0.11334989219903946,
      0.08209539949893951,
      0.08470745384693146,
      0.10040798038244247,
      0.11522872000932693,
      0.14363810420036316,
      0.144377663731575,
      0.15497153997421265,
      0.16068941354751587,
      0.15394853055477142,
      0.10899854451417923,
      0.08499860018491745,
      0.08894061297178268,
      0.09260476380586624,
      0.1021479070186615,
      0.1091911643743515,
      0.1471496969461441,
      0.14117667078971863,
      0.11645237356424332,
      0.11561853438615799,
      0.14161454141139984,
      0.16202861070632935,
      0.15244022011756897,
      0.13477244973182678,
      0.11441449820995331,
      0.12282798439264297,
      0.15809878706932068,
      0.10805857181549072,
      0.0739760473370552,
      0.07652652263641357,
      0.09257513284683228,
      0.10562993586063385,
      0.13091477751731873,
      0.13177533447742462,
      0.1471019685268402,
      0.13236872851848602,
      0.09184107929468155,
      0.10136028379201889,
      0.14005599915981293,
      0.16922473907470703,
      0.1586628258228302,
      0.12192864716053009,
      0.08878883719444275,
      0.09510829299688339,
      0.13907845318317413,
      0.11611548811197281,
      0.10750900954008102,
      0.13184280693531036,
      0.15352758765220642,
      0.14417003095149994,
      0.12767212092876434,
      0.11116445064544678,
      0.12666545808315277,
      0.13840462267398834,
      0.11578728258609772,
      0.13596893846988678,
      0.1525823026895523,
      0.157219797372818,
      0.1326163411140442,
      0.10750716179609299,
      0.11037007719278336,
      0.11897481977939606,
      0.13271881639957428,
      0.0933011844754219,
      0.09469587355852127,
      0.13283276557922363,
      0.16241513192653656,
      0.14822565019130707,
      0.11263414472341537,
      0.0826767310500145,
      0.0987209752202034,
      0.11996079981327057,
      0.08278036117553711,
      0.11537861078977585,
      0.1537213921546936,
      0.16628842055797577,
      0.1287049502134323,
      0.09022511541843414,
      0.08533769845962524,
      0.11244329810142517,
      0.1402679830789566,
      0.12109556049108505,
      0.14400598406791687,
      0.160831019282341,
      0.1658661812543869,
      0.14195914566516876,
      0.11577597260475159,
      0.1137484684586525,
      0.123914934694767,
      0.15046413242816925,
      0.10948792845010757,
      0.10060258209705353,
      0.0947568416595459,
      0.09269477427005768,
      0.08774644136428833,
      0.11453225463628769,
      0.15196458995342255,
      0.14890094101428986,
      0.11944346874952316,
      0.08949624747037888,
      0.12485332787036896,
      0.16334843635559082,
      0.17370127141475677,
      0.1360449492931366,
      0.09656289219856262,
      0.0870773047208786,
      0.11284683644771576,
      0.14856983721256256,
      0.13279849290847778,
      0.13079895079135895,
      0.11160320043563843,
      0.09948532283306122,
      0.0829271599650383,
      0.07744953036308289,
      0.10418245941400528,
      0.14221656322479248,
      0.15152840316295624,
      0.11664172261953354,
      0.10691529512405396,
      0.10119747370481491,
      0.10039374977350235,
      0.09573715925216675,
      0.1184377670288086,
      0.16082870960235596,
      0.15386278927326202,
      0.21511805057525635,
      0.1468852013349533,
      0.09786687791347504,
      0.06516271829605103,
      0.05466651916503906,
      0.055040862411260605,
      0.05977998673915863,
      0.11591590940952301,
      0.16229158639907837,
      0.1525861769914627,
      0.142633855342865,
      0.14204077422618866,
      0.12107934802770615,
      0.10725444555282593,
      0.0906224474310875,
      0.08488015085458755,
      0.10759999603033066,
      0.1415146440267563,
      0.20981062948703766,
      0.16724203526973724,
      0.12568818032741547,
      0.07814545184373856,
      0.06132974475622177,
      0.05225761979818344,
      0.059030428528785706,
      0.08670563250780106,
      0.1550074964761734,
      0.2199445217847824,
      0.15374913811683655,
      0.1013031154870987,
      0.06763897836208344,
      0.05906335636973381,
      0.05870767682790756,
      0.06321460753679276,
      0.11891991645097733,
      0.17411953210830688,
      0.1963939666748047,
      0.13304820656776428,
      0.08179425448179245,
      0.0480005256831646,
      0.12742719054222107,
      0.04539090022444725,
      0.04953160509467125,
      0.06945672631263733,
      0.18567514419555664,
      0.21584442257881165,
      0.17900927364826202,
      0.13113586604595184,
      0.07954339683055878,
      0.06484602391719818,
      0.056619394570589066,
      0.06279335170984268,
      0.08586260676383972,
      0.16709576547145844,
      0.18266187608242035,
      0.12817984819412231,
      0.09616036713123322,
      0.0582728385925293,
      0.1329679638147354,
      0.049987856298685074,
      0.0560762919485569,
      0.08045953512191772,
      0.1636660248041153,
      0.18359941244125366,
      0.08231466263532639,
      0.05573524534702301,
      0.04840092733502388,
      0.13098274171352386,
      0.05673116073012352,
      0.09295468032360077,
      0.1273273378610611,
      0.15641017258167267,
      0.1900755912065506,
      0.08342567831277847,
      0.06191582605242729,
      0.05825263634324074,
      0.06590091437101364,
      0.08185102790594101,
      0.1332630217075348,
      0.18631762266159058,
      0.21654507517814636,
      0.21976076066493988,
      0.05740075558423996,
      0.049804966896772385,
      0.04799925908446312,
      0.12237907201051712,
      0.052397530525922775,
      0.08013034611940384,
      0.09032592922449112,
      0.1154426857829094,
      0.2502754032611847,
      0.06413605064153671,
      0.05603422597050667,
      0.056596528738737106,
      0.07640114426612854,
      0.08194717019796371,
      0.13086216151714325,
      0.14787153899669647,
      0.1728089451789856,
      0.1753017008304596,
      0.08103248476982117,
      0.05742057040333748,
      0.052831511944532394,
      0.06126553565263748,
      0.0771326795220375,
      0.12537342309951782,
      0.1721017211675644,
      0.2007550597190857,
      0.16613078117370605,
      0.11444829404354095,
      0.0814458504319191,
      0.08334408700466156,
      0.09939423948526382,
      0.11415074020624161,
      0.14281460642814636,
      0.1434125453233719,
      0.15645575523376465,
      0.23241227865219116,
      0.057665709406137466,
      0.05135080963373184,
      0.05253750458359718,
      0.07217627018690109,
      0.07848905026912689,
      0.12260905653238297,
      0.13326306641101837,
      0.1603996902704239,
      0.22141866385936737,
      0.06287924200296402,
      0.04695013165473938,
      0.05403733626008034,
      0.08200695365667343,
      0.10834106057882309,
      0.14882662892341614,
      0.12881234288215637,
      0.12184197455644608,
      0.1709107905626297,
      0.12138845026493073,
      0.08168802410364151,
      0.08384369313716888,
      0.10052495449781418,
      0.11330822855234146,
      0.14065007865428925,
      0.1417686641216278,
      0.16108913719654083,
      0.14611566066741943,
      0.10269374400377274,
      0.10838907212018967,
      0.14687274396419525,
      0.17679470777511597,
      0.166236013174057,
      0.12753823399543762,
      0.09406919032335281,
      0.10544411838054657,
      0.22610576450824738,
      0.0662391185760498,
      0.047198664397001266,
      0.05355512350797653,
      0.08172149211168289,
      0.10826116800308228,
      0.14306965470314026,
      0.1244213730096817,
      0.12384223937988281,
      0.19821183383464813,
      0.07092637568712234,
      0.06877803057432175,
      0.09329517930746078,
      0.12636083364486694,
      0.12755663692951202,
      0.11553473025560379,
      0.08522967249155045,
      0.07528240978717804,
      0.14781203866004944,
      0.11079572141170502,
      0.10704436898231506,
      0.14651715755462646,
      0.1764114499092102,
      0.162140890955925,
      0.12422509491443634,
      0.09323576837778091,
      0.11511443555355072,
      0.1387413740158081,
      0.0937604084610939,
      0.1276194304227829,
      0.1676739603281021,
      0.18070396780967712,
      0.14252138137817383,
      0.10230414569377899,
      0.10121999680995941,
      0.12799566984176636,
      0.19904126226902008,
      0.08220241963863373,
      0.06922554224729538,
      0.09124322980642319,
      0.122373566031456,
      0.12278405576944351,
      0.11046969890594482,
      0.0836169421672821,
      0.07947339117527008,
      0.18859745562076569,
      0.08330293744802475,
      0.10945180058479309,
      0.12606477737426758,
      0.1300804764032364,
      0.09524499624967575,
      0.06657617539167404,
      0.07362476736307144,
      0.09184803068637848,
      0.1300906240940094,
      0.09615950286388397,
      0.1315910518169403,
      0.17165282368659973,
      0.18227757513523102,
      0.14402565360069275,
      0.10462429374456406,
      0.09983379393815994,
      0.12578482925891876,
      0.16656816005706787,
      0.14627008140087128,
      0.14124733209609985,
      0.1199481189250946,
      0.10790811479091644,
      0.0911625474691391,
      0.08683504164218903,
      0.11842645704746246,
      0.15016509592533112,
      0.1919352114200592,
