{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "elevate_emotion_mlp",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              1764
            ],
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "batch_input_shape": [
              null,
              512
            ],
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "batch_input_shape": [
              null,
              128
            ],
            "dtype": "float32",
            "units": 6,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "train_emotion_fast.py (Elevate)",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            1764,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            512,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            128,
            6
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            6
          ],
          "dtype": "float32"
        },
        {
          "name": "scaler/mean",
          "shape": [
            1764
          ],
          "dtype": "float32"
        },
        {
          "name": "scaler/std",
          "shape": [
            1764
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "elevate_meta": {
    "class_names": [
      "happy",
      "bored",
      "focused",
      "confused",
      "neutral",
      "angry"
    ],
    "img_size": 48,
    "hog_orientations": 9,
    "hog_pixels_per_cell": [
      6,
      6
    ],
    "hog_cells_per_block": [
      2,
      2
    ],
    "feature_dim": 1764,
    "architecture": "HOG(48x48) \u2192 Dense(512,relu) \u2192 Dense(128,relu) \u2192 Dense(6,softmax)",
    "normalisation": "StandardScaler (zero-mean, unit-variance) \u2014 weights at scaler/mean and scaler/std",
    "scaler_mean": [
      0.24910719692707062,
      0.1200166642665863,
      0.08886624872684479,
      0.05780577287077904,
      0.11728309094905853,
      0.03052532486617565,
      0.030112598091363907,
      0.042691733688116074,
      0.09365404397249222,
      0.2639337480068207,
      0.15279296040534973,
      0.1459416151046753,
      0.09937474131584167,
      0.07793259620666504,
      0.03577776625752449,
      0.03358156979084015,
      0.04416327551007271,
      0.10718116164207458,
      0.25465527176856995,
      0.15624931454658508,
      0.0927087739109993,
      0.054877832531929016,
      0.11872954666614532,
      0.035775769501924515,
      0.04231176897883415,
      0.061958495527505875,
      0.14237277209758759,
      0.24880263209342957,
      0.15895867347717285,
      0.1298854947090149,
      0.09122458845376968,
      0.07550273835659027,
      0.05660366266965866,
      0.05341781675815582,
      0.06483365595340729,
      0.1450490802526474,
      0.26688799262046814,
      0.14498533308506012,
      0.1388314813375473,
      0.09482637047767639,
      0.07366368174552917,
      0.035491008311510086,
      0.032821495085954666,
      0.043989453464746475,
      0.08675165474414825,
      0.22651921212673187,
      0.10902684181928635,
      0.1311381310224533,
      0.11846526712179184,
      0.10326655209064484,
      0.04939529299736023,
      0.03789137303829193,
      0.03756428882479668,
      0.0485176183283329,
      0.25289487838745117,
      0.1528148353099823,
      0.12471871078014374,
      0.0886506587266922,
      0.0754493921995163,
      0.05717102810740471,
      0.053079333156347275,
      0.06508146971464157,
      0.12552884221076965,
      0.19998137652873993,
      0.13242319226264954,
      0.10203901678323746,
      0.10704627633094788,
      0.11403829604387283,
      0.09205473959445953,
      0.06971947103738785,
      0.05914027616381645,
      0.07619453221559525,
      0.2303331196308136,
      0.11374681442975998,
      0.13598208129405975,
      0.12297707796096802,
      0.10532162338495255,
      0.05480223149061203,
      0.04245087876915932,
      0.042639732360839844,
      0.05323966592550278,
      0.16855421662330627,
      0.1308194100856781,
      0.12495174258947372,
      0.13053186237812042,
      0.13005343079566956,
      0.09339425712823868,
      0.07539317011833191,
      0.054037004709243774,
      0.040520478039979935,
      0.19183780252933502,
      0.13166235387325287,
      0.10987518727779388,
      0.11681827902793884,
      0.12560780346393585,
      0.10246673971414566,
      0.07900926470756531,
      0.0682726502418518,
      0.08181942254304886,
      0.16515004634857178,
      0.16303300857543945,
      0.11600058525800705,
      0.12171511352062225,
      0.13796353340148926,
      0.12328360229730606,
      0.10014844685792923,
      0.09846920520067215,
      0.08997965604066849,
      0.17199793457984924,
      0.12242382019758224,
      0.12509222328662872,
      0.1336204707622528,
      0.13287504017353058,
      0.09750273823738098,
      0.07879835367202759,
      0.057669006288051605,
      0.04361118748784065,
      0.15961356461048126,
      0.0653969869017601,
      0.08959779888391495,
      0.11044932156801224,
      0.1417636275291443,
      0.13973459601402283,
      0.13091829419136047,
      0.11824285238981247,
      0.06049945577979088,
      0.1521424800157547,
      0.14652521908283234,
      0.1182260513305664,
      0.12810051441192627,
      0.1444409340620041,
      0.129289910197258,
      0.10700540989637375,
      0.10229355841875076,
      0.09148862212896347,
      0.11445469409227371,
      0.11595205217599869,
      0.11515793949365616,
      0.13763558864593506,
      0.15138445794582367,
      0.1333635300397873,
      0.12218810617923737,
      0.1413155049085617,
      0.13780879974365234,
      0.1517106592655182,
      0.061213430017232895,
      0.08610810339450836,
      0.10713497549295425,
      0.13957726955413818,
      0.13829472661018372,
      0.13176685571670532,
      0.1202191710472107,
      0.05906356871128082,
      0.17833377420902252,
      0.04093766584992409,
      0.04362577944993973,
      0.056912533938884735,
      0.10566884279251099,
      0.12134623527526855,
      0.13799656927585602,
      0.1247270405292511,
      0.11711906641721725,
      0.1129092276096344,
      0.11268044263124466,
      0.10789734125137329,
      0.13170263171195984,
      0.14501740038394928,
      0.12698988616466522,
      0.11996041983366013,
      0.14938126504421234,
      0.14390888810157776,
      0.10590902715921402,
      0.06844136863946915,
      0.08319045603275299,
      0.10838769376277924,
      0.1272374540567398,
      0.11443310976028442,
      0.10916467756032944,
      0.1462661772966385,
      0.1649627983570099,
      0.16947807371616364,
      0.03618595004081726,
      0.03926409035921097,
      0.051495056599378586,
      0.10555808246135712,
      0.1173514872789383,
      0.13502848148345947,
      0.12347531318664551,
      0.11421220749616623,
      0.22383102774620056,
      0.03903187811374664,
      0.03258505463600159,
      0.03668888285756111,
      0.07923558354377747,
      0.09608377516269684,
      0.1379769891500473,
      0.1411011964082718,
      0.175458163022995,
      0.1032019704580307,
      0.06003643199801445,
      0.07403833419084549,
      0.09800364822149277,
      0.11687935143709183,
      0.10648291558027267,
      0.10221128910779953,
      0.1525605320930481,
      0.17628583312034607,
      0.137661412358284,
      0.06034139171242714,
      0.05269604176282883,
      0.060802944004535675,
      0.08279068768024445,
      0.08839115500450134,
      0.1211145743727684,
      0.15168322622776031,
      0.22206580638885498,
      0.2228115051984787,
      0.039356816560029984,
      0.033255383372306824,
      0.036889269948005676,
      0.08428140729665756,
      0.10045516490936279,
      0.14417363703250885,
      0.14787839353084564,
      0.17832307517528534,
      0.20899392664432526,
      0.04835200682282448,
      0.03127053380012512,
      0.030403586104512215,
      0.12511982023715973,
      0.0613994300365448,
      0.09464167058467865,
      0.12285088747739792,
      0.16894879937171936,
      0.148000568151474,
      0.0605807863175869,
      0.052600469440221786,
      0.059983450919389725,
      0.08293174207210541,
      0.0904008075594902,
      0.12548239529132843,
      0.15674462914466858,
      0.2193431556224823,
      0.17375396192073822,
      0.058824390172958374,
      0.0406733937561512,
      0.03630746155977249,
      0.12604078650474548,
      0.05782820284366608,
      0.09657388925552368,
      0.158341184258461,
      0.22569283843040466,
      0.2451779544353485,
      0.14393773674964905,
      0.084221750497818,
      0.048958126455545425,
      0.10882642865180969,
      0.03186389058828354,
      0.03815668076276779,
      0.05695393308997154,
      0.13403548300266266,
      0.23846082389354706,
      0.14746883511543274,
      0.11933616548776627,
      0.08220604807138443,
      0.0669061541557312,
      0.050346557050943375,
      0.047820232808589935,
      0.059296615421772,
      0.13728414475917816,
      0.25519120693206787,
      0.13887205719947815,
      0.07293373346328735,
      0.04664287716150284,
      0.11662285774946213,
      0.03883941099047661,
      0.04750797525048256,
      0.07611524313688278,
      0.15503498911857605,
      0.2456561177968979,
      0.14090776443481445,
      0.12767185270786285,
      0.12158188968896866,
      0.1117716133594513,
      0.08280894160270691,
      0.06898444890975952,
      0.07651788741350174,
      0.15366500616073608,
      0.23384062945842743,
      0.13442294299602509,
      0.1099526435136795,
      0.0762418732047081,
      0.06133842095732689,
      0.04665907844901085,
      0.04316993057727814,
      0.05418414995074272,
      0.11299470067024231,
      0.18708987534046173,
      0.11703898012638092,
      0.08767059445381165,
      0.09065378457307816,
      0.09623229503631592,
      0.07778703421354294,
      0.057611461728811264,
      0.04877403751015663,
      0.06805817037820816,
      0.23584312200546265,
      0.12877951562404633,
      0.11942704766988754,
      0.11517374962568283,
      0.10507114231586456,
      0.07824122160673141,
      0.0640576109290123,
      0.06997852772474289,
      0.12860961258411407,
      0.19175221025943756,
      0.1034148782491684,
      0.10641505569219589,
      0.1327228546142578,
      0.1561695635318756,
      0.14292187988758087,
      0.1092977374792099,
      0.07926886528730392,
      0.10097231715917587,
      0.16952532529830933,
      0.11154687404632568,
      0.0886421650648117,
      0.0938090980052948,
      0.10014268755912781,
      0.08152203261852264,
      0.060620952397584915,
      0.0510651171207428,
      0.06668177992105484,
      0.14620982110500336,
      0.14489656686782837,
      0.09608281403779984,
      0.09989709407091141,
      0.11286663264036179,
      0.10094322264194489,
      0.08124381303787231,
      0.08247984945774078,
      0.07489804923534393,
      0.17211413383483887,
      0.10065367072820663,
      0.11044301092624664,
      0.1378607302904129,
      0.16127252578735352,
      0.14840923249721527,
      0.11551959067583084,
      0.08376489579677582,
      0.09671793133020401,
      0.17671196162700653,
      0.1325524002313614,
      0.10791829973459244,
      0.11762414127588272,
      0.13062739372253418,
      0.13929018378257751,
      0.14202085137367249,
      0.1377427875995636,
      0.13401742279529572,
      0.13833299279212952,
      0.13446417450904846,
      0.09794611483812332,
      0.10370700061321259,
      0.11648404598236084,
      0.10496462136507034,
      0.08633117377758026,
      0.08540409803390503,
      0.0758470743894577,
      0.09466901421546936,
      0.09966579079627991,
      0.09380624443292618,
      0.11346899718046188,
      0.12258299440145493,
      0.10779887437820435,
      0.10031445324420929,
      0.12667813897132874,
      0.12632907927036285,
      0.16939517855644226,
      0.12929095327854156,
      0.10997103899717331,
      0.1205962523818016,
      0.13454459607601166,
      0.1420511156320572,
      0.14464060962200165,
      0.14251887798309326,
      0.13909153640270233,
      0.15586504340171814,
      0.15347281098365784,
      0.14703162014484406,
      0.1422511339187622,
      0.13591203093528748,
      0.12059874832630157,
      0.11285366863012314,
      0.12963296473026276,
      0.15726010501384735,
      0.09335757046937943,
      0.09730430692434311,
      0.08897551894187927,
      0.10928315669298172,
      0.1184689849615097,
      0.10379112511873245,
      0.09877458214759827,
      0.13286733627319336,
      0.13022978603839874,
      0.08767648786306381,
      0.05165816470980644,
      0.06431866437196732,
      0.08647020161151886,
      0.09975320100784302,
      0.09031126648187637,
      0.08759812265634537,
      0.12798593938350677,
      0.1515791267156601,
      0.15180963277816772,
      0.14906595647335052,
      0.14343875646591187,
      0.13842782378196716,
      0.13134250044822693,
      0.11678888648748398,
      0.11018460243940353,
      0.13150528073310852,
      0.16084226965904236,
      0.12495100498199463,
      0.09106981754302979,
      0.12081427127122879,
      0.15090246498584747,
      0.1581145077943802,
      0.13282307982444763,
      0.11073102802038193,
      0.10969460755586624,
      0.16407281160354614,
      0.09222888201475143,
      0.04963050037622452,
      0.06113899499177933,
      0.0827021524310112,
      0.09755086153745651,
      0.08813151717185974,
      0.0871591567993164,
      0.1376836597919464,
      0.17007018625736237,
      0.12420113384723663,
      0.049741730093955994,
      0.04272332787513733,
      0.04946034774184227,
      0.0670553594827652,
      0.07570874691009521,
      0.10676207393407822,
      0.13413935899734497,
      0.2100568562746048,
      0.1325298547744751,
      0.08683399111032486,
      0.1158498078584671,
      0.14618618786334991,
      0.1538526862859726,
      0.128420889377594,
      0.10763338953256607,
      0.11416096985340118,
      0.18530069291591644,
      0.13495062291622162,
      0.06820037961006165,
      0.06638189405202866,
      0.08309873193502426,
      0.10887522250413895,
      0.11261904984712601,
      0.11506521701812744,
      0.12658974528312683,
      0.2152685821056366,
      0.14131376147270203,
      0.05525002256035805,
      0.04710729420185089,
      0.05343297868967056,
      0.07395266741514206,
      0.08162137866020203,
      0.11590917408466339,
      0.14691461622714996,
      0.21809157729148865,
      0.16543664038181305,
      0.05399659648537636,
      0.036472078412771225,
      0.03219842538237572,
      0.11508896201848984,
      0.05161949619650841,
      0.08795304596424103,
      0.14720728993415833,
      0.22561219334602356,
      0.15814542770385742,
      0.07546446472406387,
      0.07178995013237,
      0.08784880489110947,
      0.11570890247821808,
      0.11878652125597,
      0.12409806996583939,
      0.13813206553459167,
      0.22961385548114777,
      0.17211441695690155,
      0.06977430731058121,
      0.04596679285168648,
      0.04117847979068756,
      0.12487057596445084,
      0.050963278859853745,
      0.07592595368623734,
      0.1367478221654892,
      0.2368316650390625,
      0.2503420412540436,
      0.1332731544971466,
      0.06917231529951096,
      0.043924324214458466,
      0.11236605793237686,
      0.03679991513490677,
      0.04536017030477524,
      0.07299130409955978,
      0.1526806801557541,
      0.24145780503749847,
      0.13579894602298737,
      0.12132390588521957,
      0.11541249603033066,
      0.10563991218805313,
      0.07911816984415054,
      0.06670311838388443,
      0.07458259910345078,
      0.14872024953365326,
      0.24911732971668243,
      0.11184924095869064,
      0.052769068628549576,
      0.03907078132033348,
      0.11007052659988403,
      0.03722550719976425,
      0.05426352471113205,
      0.08768823742866516,
      0.17137639224529266,
      0.23757337033748627,
      0.10676345229148865,
      0.0880524143576622,
      0.0875408723950386,
      0.0992952212691307,
      0.09444738179445267,
      0.08676590770483017,
      0.09511952102184296,
      0.17889820039272308,
      0.22235116362571716,
      0.11752913147211075,
      0.10796728730201721,
      0.10346044600009918,
      0.09474866092205048,
      0.07044452428817749,
      0.05846724659204483,
      0.06503420323133469,
      0.12190381437540054,
      0.18430860340595245,
      0.09740996360778809,
      0.09931908547878265,
      0.12182056903839111,
      0.14313961565494537,
      0.1295117735862732,
      0.09969503432512283,
      0.07301843911409378,
      0.09606129676103592,
      0.22371329367160797,
      0.09191203862428665,
      0.07666542381048203,
      0.07683894038200378,
      0.08661416172981262,
      0.08393320441246033,
      0.07683698832988739,
      0.0836067870259285,
      0.1457727998495102,
      0.19407624006271362,
      0.10500568151473999,
      0.10912308841943741,
      0.12736113369464874,
      0.13502469658851624,
      0.11313226819038391,
      0.08978801220655441,
      0.08414958417415619,
      0.140093594789505,
      0.16375163197517395,
      0.0914568156003952,
      0.09766211360692978,
      0.12129000574350357,
      0.14316128194332123,
      0.13007859885692596,
      0.10058596730232239,
      0.07312596589326859,
      0.08858152478933334,
      0.16283051669597626,
      0.120787113904953,
      0.0981961041688919,
      0.1034746915102005,
      0.11468125879764557,
      0.12059187144041061,
      0.12406186014413834,
      0.12223123759031296,
      0.1213112473487854,
      0.17463018000125885,
      0.10216540843248367,
      0.10939878225326538,
      0.12830157577991486,
      0.13473844528198242,
      0.11384623497724533,
      0.08903303742408752,
      0.08199162036180496,
      0.1222284585237503,
      0.20714326202869415,
      0.13709531724452972,
      0.11333991587162018,
      0.09894969314336777,
      0.09049929678440094,
      0.08278439939022064,
      0.08890275657176971,
      0.14033780992031097,
      0.19584393501281738,
      0.15772251784801483,
      0.12013669312000275,
      0.09993401914834976,
      0.10585920512676239,
      0.11835148185491562,
      0.1249580830335617,
      0.12795545160770416,
      0.1264868974685669,
      0.12564928829669952,
      0.14121828973293304,
      0.13718640804290771,
      0.12987805902957916,
      0.1248190626502037,
      0.11926931142807007,
      0.10615228861570358,
      0.10186228901147842,
      0.11945035308599472,
      0.14555120468139648,
      0.20385363698005676,
      0.14220385253429413,
      0.11840151250362396,
      0.10452630370855331,
      0.09458962082862854,
      0.08592179417610168,
      0.0917673110961914,
      0.1417570859193802,
      0.18939609825611115,
      0.19283004105091095,
      0.14337660372257233,
      0.09294608980417252,
      0.08613842725753784,
      0.09529536962509155,
      0.10402438044548035,
      0.11731263250112534,
      0.14218033850193024,
      0.18878167867660522,
      0.13896191120147705,
      0.13437393307685852,
      0.12654615938663483,
      0.12110395729541779,
      0.11622101068496704,
      0.10406399518251419,
      0.10053542256355286,
      0.12022016942501068,
      0.14957480132579803,
      0.11615128815174103,
      0.08029572665691376,
      0.106389120221138,
      0.1334422081708908,
      0.14080874621868134,
      0.11768701672554016,
      0.09881774336099625,
      0.10098323225975037,
      0.15984420478343964,
      0.19757357239723206,
      0.14310607314109802,
      0.09077724814414978,
      0.08330691605806351,
      0.09153468906879425,
      0.09878166019916534,
      0.11247751116752625,
      0.13804443180561066,
      0.1905541867017746,
      0.14291617274284363,
      0.08808908611536026,
      0.08805239200592041,
      0.11167316138744354,
      0.130547896027565,
      0.12311746180057526,
      0.10419885814189911,
      0.09981320798397064,
      0.16714276373386383,
      0.12663401663303375,
      0.08052215725183487,
      0.10650637745857239,
      0.13390223681926727,
      0.1418771594762802,
      0.11858872324228287,
      0.10068917274475098,
      0.10777196288108826,
      0.18020646274089813,
      0.12857355177402496,
      0.06367006152868271,
      0.06132221221923828,
      0.07523360848426819,
      0.09869571030139923,
      0.10152272135019302,
      0.10480156540870667,
      0.11620915681123734,
      0.20544542372226715,
      0.15614746510982513,
      0.09105344861745834,
      0.08894552290439606,
      0.111366868019104,
      0.13054312765598297,
      0.12224611639976501,
      0.10383721441030502,
      0.10252157598733902,
      0.1870277225971222,
      0.15859082341194153,
      0.07830119878053665,
      0.07640810310840607,
      0.0840068832039833,
      0.08719482272863388,
      0.07578518986701965,
      0.07538150995969772,
      0.09134361147880554,
      0.20597676932811737,
      0.15492047369480133,
      0.07330996543169022,
      0.06956172734498978,
      0.08408372104167938,
      0.10922824591398239,
      0.11308105289936066,
      0.11833208799362183,
      0.13355417549610138,
      0.22669516503810883,
      0.170188769698143,
      0.06766650825738907,
      0.04411877691745758,
      0.03880626708269119,
      0.11982116103172302,
      0.04784068465232849,
      0.07215695083141327,
      0.13205626606941223,
      0.23373793065547943,
      0.1876906454563141,
      0.08971188962459564,
      0.08625370264053345,
      0.09409219026565552,
      0.09928615391254425,
      0.08594797551631927,
      0.08631668984889984,
      0.1052573099732399,
      0.22003459930419922,
      0.19474701583385468,
      0.08573978394269943,
      0.05383168160915375,
      0.040455467998981476,
      0.11482510715723038,
      0.042034804821014404,
      0.05634066462516785,
      0.11082945764064789,
      0.23221074044704437,
      0.2570243775844574,
      0.11465668678283691,
      0.05589607357978821,
      0.0416107214987278,
      0.1169317290186882,
      0.04117283970117569,
      0.05887624993920326,
      0.09385288506746292,
      0.17893467843532562,
      0.24742771685123444,
      0.11252463608980179,
      0.09238878637552261,
      0.09286592155694962,
      0.10527631640434265,
      0.10221437364816666,
      0.0945926159620285,
      0.10277044773101807,
      0.18096622824668884,
      0.23372842371463776,
      0.08140798658132553,
      0.049482595175504684,
      0.037735674530267715,
      0.11988400667905807,
      0.03993711248040199,
      0.06628432124853134,
      0.11550485342741013,
      0.17521421611309052,
      0.21527323126792908,
      0.08362547308206558,
      0.07074607908725739,
      0.06255511939525604,
      0.06050488352775574,
      0.059577737003564835,
      0.08107871562242508,
      0.12281631678342819,
      0.19444628059864044,
      0.22734229266643524,
      0.10240928828716278,
      0.0860280767083168,
      0.08718689531087875,
      0.0989498496055603,
      0.09717903286218643,
      0.08910831809043884,
      0.09583574533462524,
      0.15724873542785645,
      0.19462153315544128,
      0.11572429537773132,
      0.12193531543016434,
      0.1410093456506729,
      0.14785528182983398,
      0.12702016532421112,
      0.10196498036384583,
      0.09423280507326126,
      0.1479596346616745,
      0.19992230832576752,
      0.07582830637693405,
      0.06591352075338364,
      0.05872690677642822,
      0.056741245090961456,
      0.055612627416849136,
      0.07707091420888901,
      0.1152695044875145,
      0.17288485169410706,
      0.1856389045715332,
      0.13421861827373505,
      0.11705085635185242,
      0.09484269469976425,
      0.08260251581668854,
      0.07040896266698837,
      0.07007493823766708,
      0.08240795135498047,
      0.15224681794643402,
      0.17199712991714478,
      0.10895906388759613,
      0.11644003540277481,
      0.13444074988365173,
      0.13998019695281982,
      0.12207402288913727,
      0.09767644107341766,
      0.08900099992752075,
      0.12692907452583313,
      0.206992968916893,
      0.14550654590129852,
      0.12143666297197342,
      0.10744524002075195,
      0.09752403944730759,
      0.08901838213205338,
      0.0945276990532875,
      0.1460876762866974,
      0.1955496072769165,
      0.16297884285449982,
      0.11942622065544128,
      0.10970126837491989,
      0.09076274186372757,
      0.07899138331413269,
      0.06695392727851868,
      0.0661206990480423,
      0.0759730339050293,
      0.13409730792045593,
      0.1789630502462387,
      0.1504325270652771,
      0.11711552739143372,
      0.10621842741966248,
      0.10987966507673264,
      0.10333177447319031,
      0.11719522625207901,
      0.16427670419216156,
      0.1617777794599533,
      0.19789937138557434,
      0.14265450835227966,
      0.11923476308584213,
      0.104505755007267,
      0.09505615383386612,
      0.08720995485782623,
      0.09302008897066116,
      0.14099369943141937,
      0.18417759239673615,
      0.1885005384683609,
      0.14238229393959045,
      0.09419754147529602,
      0.08740736544132233,
      0.095461405813694,
      0.10418765991926193,
      0.11810559034347534,
      0.14255492389202118,
      0.1846822053194046,
      0.1724095344543457,
      0.14584757387638092,
      0.11300059407949448,
      0.10237700492143631,
      0.10608193278312683,
      0.09997988492250443,
      0.11340216547250748,
      0.15470173954963684,
      0.15468628704547882,
      0.16091440618038177,
      0.15642349421977997,
      0.11772029846906662,
      0.10606791079044342,
      0.11259391158819199,
      0.1060900166630745,
      0.11863458901643753,
      0.14081904292106628,
      0.15170152485370636,
      0.20236609876155853,
      0.1497558355331421,
      0.09705379605293274,
      0.08971988409757614,
      0.09840573370456696,
      0.10775914788246155,
      0.12129940092563629,
      0.14668340981006622,
      0.19430579245090485,
      0.14804045855998993,
      0.09501343965530396,
      0.09698376059532166,
      0.11954527348279953,
      0.13579890131950378,
      0.12947797775268555,
      0.11119404435157776,
      0.10656231641769409,
      0.16915415227413177,
      0.168974369764328,
      0.16826629638671875,
      0.12265820056200027,
      0.10983039438724518,
      0.11743880808353424,
      0.11005672067403793,
      0.12337742745876312,
      0.14568991959095,
      0.15802714228630066,
      0.13551917672157288,
      0.07923881709575653,
      0.06658311188220978,
      0.06721291691064835,
      0.07943680137395859,
      0.09158693253993988,
      0.11059270054101944,
      0.11821706593036652,
      0.15578515827655792,
      0.16618967056274414,
      0.10163052380084991,
      0.10162395238876343,
      0.12535299360752106,
      0.14372649788856506,
      0.13620518147945404,
      0.11656471341848373,
      0.11350495368242264,
      0.1909843534231186,
      0.17205949127674103,
      0.09018940478563309,
      0.08892395347356796,
      0.09706825762987137,
      0.09900856763124466,
      0.0856621265411377,
      0.08464711904525757,
      0.10131774097681046,
      0.21211396157741547,
      0.15213856101036072,
      0.0862056165933609,
      0.07124804705381393,
      0.07155503332614899,
      0.08391902595758438,
      0.09667671471834183,
      0.11815934628248215,
      0.13016709685325623,
      0.17593137919902802,
      0.19297869503498077,
      0.10595131665468216,
      0.0720803290605545,
      0.0565936341881752,
      0.06015504151582718,
      0.06281788647174835,
      0.07052376121282578,
      0.07856876403093338,
      0.18181923031806946,
      0.19199608266353607,
      0.09703972935676575,
      0.09453986585140228,
      0.10236036777496338,
      0.10538588464260101,
      0.09138482064008713,
      0.09124857932329178,
      0.11099369078874588,
      0.22838616371154785,
      0.20245401561260223,
      0.09312368184328079,
      0.059139374643564224,
      0.04514416307210922,
      0.12234319001436234,
      0.0446053147315979,
      0.0597204826772213,
      0.11461494117975235,
      0.23837466537952423,
      0.21240182220935822,
      0.11371182650327682,
      0.07628791034221649,
      0.06072543188929558,
      0.06426943093538284,
      0.06746838241815567,
      0.07597844302654266,
      0.08566174656152725,
      0.19322194159030914,
      0.19079606235027313,
      0.10914992541074753,
      0.06429506838321686,
      0.04040228947997093,
      0.11927817016839981,
      0.040172021836042404,
      0.05055374279618263,
      0.08420848101377487,
      0.2141488790512085,
      0.2338913083076477,
      0.08379605412483215,
      0.0512884147465229,
      0.039711788296699524,
      0.12545426189899445,
      0.04313414543867111,
      0.07106500118970871,
      0.12352722138166428,
      0.18245956301689148,
      0.22060273587703705,
      0.08652795851230621,
      0.07373046875,
      0.06696247309446335,
      0.0656999796628952,
      0.06452441215515137,
      0.08824679255485535,
      0.1313782036304474,
      0.1996067464351654,
      0.21628005802631378,
      0.07514352351427078,
      0.0493382103741169,
      0.042316075414419174,
      0.124240942299366,
      0.045308567583560944,
      0.07672847807407379,
      0.12694697082042694,
      0.17716385424137115,
      0.20638754963874817,
      0.10198559612035751,
      0.0595378503203392,
      0.054430004209280014,
      0.05559338256716728,
      0.06252767890691757,
      0.1001465693116188,
      0.15570692718029022,
      0.21833524107933044,
      0.2026451826095581,
      0.08236728608608246,
      0.07142753899097443,
      0.06505938619375229,
      0.06396544724702835,
      0.06308852881193161,
      0.08675443381071091,
      0.12788118422031403,
      0.18573741614818573,
      0.18728676438331604,
      0.14288505911827087,
      0.1270940899848938,
      0.10590027272701263,
      0.09288887679576874,
      0.07858384400606155,
      0.07742394506931305,
      0.09037592262029648,
      0.15496604144573212,
      0.18825915455818176,
      0.09717506915330887,
      0.056913651525974274,
      0.052083950489759445,
      0.052969545125961304,
      0.06234201043844223,
      0.10031919181346893,
      0.1501087248325348,
      0.197224959731102,
      0.1809547394514084,
      0.17563578486442566,
      0.11968953162431717,
      0.09544690698385239,
      0.09868272393941879,
      0.10070619732141495,
      0.10888282209634781,
      0.1188628077507019,
      0.16477198898792267,
      0.1683529019355774,
      0.12742742896080017,
      0.11484118551015854,
      0.09526883810758591,
      0.08314645290374756,
      0.07075982540845871,
      0.07024944573640823,
      0.08241257816553116,
      0.14099501073360443,
      0.18850751221179962,
      0.1621977835893631,
      0.1281495839357376,
      0.11416207998991013,
      0.11859673261642456,
      0.11133471876382828,
      0.12901872396469116,
      0.17441247403621674,
      0.17240692675113678,
      0.16357149183750153,
      0.1589910387992859,
      0.10862859338521957,
      0.08551320433616638,
      0.0909598097205162,
      0.0931214839220047,
      0.09999789297580719,
      0.10828809440135956,
      0.14848792552947998,
      0.13391436636447906,
      0.10797788947820663,
      0.1092795580625534,
      0.13413149118423462,
      0.15166763961315155,
      0.14516860246658325,
      0.1308741718530655,
      0.11161727458238602,
      0.11521704494953156,
      0.17699050903320312,
      0.15306468307971954,
      0.11826756596565247,
      0.10392787307500839,
      0.10948173701763153,
      0.10368594527244568,
      0.12278351187705994,
      0.16395795345306396,
      0.16270889341831207,
      0.1703377366065979,
      0.16620920598506927,
      0.12889441847801208,
      0.11137426644563675,
      0.1185256689786911,
      0.1097974106669426,
      0.1264113187789917,
      0.14816683530807495,
      0.15777850151062012,
      0.126291424036026,
      0.1021389439702034,
      0.10044100880622864,
      0.1254933923482895,
      0.14396440982818604,
      0.13739600777626038,
      0.12382889539003372,
      0.10621988028287888,
      0.11260812729597092,
      0.12289904057979584,
      0.10902666300535202,
      0.13048622012138367,
      0.14561012387275696,
      0.14619240164756775,
      0.12485125660896301,
      0.09959948062896729,
      0.09701579064130783,
      0.10532257705926895,
      0.18123336136341095,
      0.1795116364955902,
      0.1364462822675705,
      0.11832413822412491,
      0.127547949552536,
      0.1190522089600563,
      0.1364385485649109,
      0.1575905829668045,
      0.16911278665065765,
      0.1472783386707306,
      0.08544913679361343,
      0.07037394493818283,
      0.07005764544010162,
      0.08243225514888763,
      0.09518902003765106,
      0.11445634067058563,
      0.12471820414066315,
      0.16086164116859436,
      0.1286352425813675,
      0.11498207598924637,
      0.13697262108325958,
      0.15294872224330902,
      0.1537420004606247,
      0.13284112513065338,
      0.10770232230424881,
      0.10280699282884598,
      0.11294231563806534,
      0.14719615876674652,
      0.10666196793317795,
      0.09881477057933807,
      0.0954471305012703,
      0.09396599978208542,
      0.0887194499373436,
      0.11302914470434189,
      0.16007477045059204,
      0.15098850429058075,
      0.15887565910816193,
      0.09315881878137589,
      0.07745146006345749,
      0.07865605503320694,
      0.0924082025885582,
      0.10604999959468842,
      0.12716804444789886,
      0.13830721378326416,
      0.17621959745883942,
      0.20567633211612701,
      0.11662178486585617,
      0.08086429536342621,
      0.06319084763526917,
      0.06600871682167053,
      0.0681118369102478,
      0.07500950247049332,
      0.08408692479133606,
      0.18312375247478485,
      0.16134636104106903,
      0.1173156350851059,
      0.1078844740986824,
      0.10374600440263748,
      0.10266131162643433,
      0.09909757971763611,
      0.12379451841115952,
      0.1738644689321518,
      0.16315408051013947,
      0.21594712138175964,
      0.1391783505678177,
      0.09396044909954071,
      0.06497763097286224,
      0.05587223917245865,
      0.05698196962475777,
      0.06339581310749054,
      0.12597592175006866,
      0.17448677122592926,
      0.21385523676872253,
      0.12085963785648346,
      0.08288677036762238,
      0.06488088518381119,
      0.06895344704389572,
      0.07147032022476196,
      0.07822513580322266,
      0.08799562603235245,
      0.19676834344863892,
      0.1961355209350586,
      0.11652380228042603,
      0.06893457472324371,
      0.043203506618738174,
      0.12396730482578278,
      0.041353579610586166,
      0.051964953541755676,
      0.0849129930138588,
      0.21266613900661469,
      0.2243281602859497,
      0.1450195610523224,
      0.09515021741390228,
      0.06602583080530167,
      0.058944880962371826,
      0.060847289860248566,
      0.06658536940813065,
      0.13297684490680695,
      0.18941225111484528,
      0.191409632563591,
      0.12322811782360077,
      0.07695257663726807,
      0.04601455107331276,
      0.12675264477729797,
      0.0468578040599823,
      0.05107622966170311,
      0.07209856808185577,
      0.19704832136631012,
      0.21014398336410522,
      0.07528311759233475,
      0.04864882305264473,
      0.04166398569941521,
      0.12297433614730835,
      0.04447566345334053,
      0.07647451758384705,
      0.12777724862098694,
      0.1767503023147583,
      0.20275716483592987,
      0.09935958683490753,
      0.05850504711270332,
      0.05356235057115555,
      0.05531277507543564,
      0.06270869076251984,
      0.1014508306980133,
      0.15760521590709686,
      0.21757075190544128,
      0.18852262198925018,
      0.08086664229631424,
      0.05382353439927101,
      0.04603252932429314,
      0.12606705725193024,
      0.05519190803170204,
      0.08767875283956528,
      0.11949916929006577,
      0.15328320860862732,
      0.1967226266860962,
      0.08337351679801941,
      0.05989319458603859,
      0.056369297206401825,
      0.06438437104225159,
      0.07874679565429688,
      0.12896889448165894,
      0.17585858702659607,
      0.21363547444343567,
      0.18245108425617218,
      0.09562133252620697,
      0.05426415055990219,
      0.0488080196082592,
      0.04912678524851799,
      0.05787216126918793,
      0.09514755010604858,
      0.1463882327079773,
      0.19413861632347107,
      0.17746877670288086,
      0.16981688141822815,
      0.1147509217262268,
      0.09037443995475769,
      0.09439197182655334,
      0.09673649072647095,
      0.10531148314476013,
      0.11545523256063461,
      0.15936437249183655,
      0.177791565656662,
      0.08156289905309677,
      0.054989293217659,
      0.05074132978916168,
      0.059876974672079086,
      0.07546386867761612,
      0.12098729610443115,
      0.1605651080608368,
      0.19421358406543732,
      0.16663360595703125,
      0.11418423801660538,
      0.07851757854223251,
      0.08278359472751617,
      0.09917900711297989,
      0.11374978721141815,
      0.13925819098949432,
      0.13654129207134247,
      0.15314549207687378,
      0.1726727932691574,
      0.1642911285161972,
      0.11204621940851212,
      0.08407963812351227,
      0.0886450856924057,
      0.09138478338718414,
      0.09984321892261505,
      0.10874291509389877,
      0.15696845948696136,
      0.1464017778635025,
      0.11589767783880234,
      0.1099829152226448,
      0.13345980644226074,
      0.15303869545459747,
      0.14635704457759857,
      0.1332770437002182,
      0.11526574194431305,
      0.12631730735301971,
      0.16559743881225586,
      0.11204016208648682,
      0.07270492613315582,
      0.07599708437919617,
      0.09302156418561935,
      0.10582580417394638,
      0.12814946472644806,
      0.12660758197307587,
      0.14881132543087006,
      0.13700087368488312,
      0.08797751367092133,
      0.0908832997083664,
      0.1295185536146164,
      0.1600046008825302,
      0.1515127271413803,
      0.1148395985364914,
      0.08336863666772842,
      0.09716640412807465,
      0.14695507287979126,
      0.11834230273962021,
      0.10388363152742386,
      0.1263611912727356,
      0.14705035090446472,
      0.14033353328704834,
      0.12844446301460266,
      0.11482924968004227,
      0.13353516161441803,
      0.14723631739616394,
      0.11854296177625656,
      0.13678604364395142,
      0.15015526115894318,
      0.15106341242790222,
      0.12789379060268402,
      0.1051071509718895,
      0.11288702487945557,
      0.1253269612789154,
      0.1403655856847763,
      0.09286830574274063,
      0.08651355654001236,
      0.12458416819572449,
      0.15513558685779572,
      0.14260566234588623,
      0.10741441696882248,
      0.07976853102445602,
      0.10403886437416077,
      0.12641212344169617,
      0.07914429903030396,
      0.10981211066246033,
      0.14785197377204895,
      0.1591048687696457,
      0.12119448184967041,
      0.08318986743688583,
      0.08603385835886002,
      0.12033900618553162,
      0.14586961269378662,
      0.12112314999103546,
      0.1424352377653122,
      0.15602482855319977,
      0.1568206548690796,
      0.13442395627498627,
      0.11094608157873154,
      0.11314203590154648,
      0.12782250344753265,
      0.1590091735124588,
      0.10853693634271622,
      0.0998631939291954,
      0.09525981545448303,
      0.0924217700958252,
      0.08762415498495102,
      0.11850342899560928,
      0.16209782660007477,
      0.16008611023426056,
      0.12242841720581055,
      0.08267579972743988,
      0.1170097291469574,
      0.15557466447353363,
      0.16411703824996948,
      0.12592783570289612,
      0.0869748666882515,
      0.08412901312112808,
      0.11767391860485077,
      0.1491622030735016,
      0.1265750676393509,
      0.12857763469219208,
      0.1125505268573761,
      0.10027886182069778,
      0.08208976686000824,
      0.07581108063459396,
      0.10789592564105988,
      0.1496865302324295,
      0.15642231702804565,
      0.11316897720098495,
      0.10401353985071182,
      0.09994173794984818,
      0.09828013181686401,
      0.09371519088745117,
      0.11923345923423767,
      0.16845470666885376,
      0.16223862767219543,
      0.21425017714500427,
      0.13493894040584564,
      0.08929688483476639,
      0.06069358438253403,
      0.05173279717564583,
      0.05417884141206741,
      0.06051810830831528,
      0.1243860125541687,
      0.17095360159873962,
      0.1487979292869568,
      0.1336258351802826,
      0.13765887916088104,
      0.12059220671653748,
      0.10626746714115143,
      0.0876157283782959,
      0.08076684921979904,
      0.10795267671346664,
      0.14503809809684753,
      0.2065703421831131,
      0.15394921600818634,
      0.1194845587015152,
      0.07735588401556015,
      0.060930974781513214,
      0.05186443775892258,
      0.05791096389293671,
      0.09079056233167648,
      0.16213823854923248,
      0.2209548056125641,
      0.14505578577518463,
      0.09520186483860016,
      0.06517601758241653,
      0.05764732137322426,
      0.0588764064013958,
      0.06447990238666534,
      0.12843693792819977,
      0.18472889065742493,
      0.19093553721904755,
      0.1241239458322525,
      0.07602352648973465,
      0.04463810473680496,
      0.12378136813640594,
      0.045201387256383896,
      0.049516815692186356,
      0.07143309712409973,
      0.19228921830654144,
      0.21482950448989868,
      0.16852831840515137,
      0.12741924822330475,
      0.08036375790834427,
      0.0653737336397171,
      0.056967638432979584,
      0.06244143471121788,
      0.09031093865633011,
      0.17685207724571228,
      0.1802349090576172,
      0.12141143530607224,
      0.09296865016222,
      0.05659225210547447,
      0.12983693182468414,
      0.049394845962524414,
      0.055398423224687576,
      0.08248814940452576,
      0.16921202838420868,
      0.19060659408569336,
      0.08497650176286697,
      0.055526744574308395,
      0.04735490307211876,
      0.12967735528945923,
      0.0564170703291893,
      0.09017305076122284,
      0.1234198808670044,
      0.1550084501504898,
      0.19888202846050262,
      0.08716674149036407,
      0.06169992685317993,
      0.057780083268880844,
      0.06696377694606781,
      0.08231942355632782,
      0.13109055161476135,
      0.17766043543815613,
      0.21671022474765778,
      0.22227661311626434,
      0.057681262493133545,
      0.04808510094881058,
      0.04597841575741768,
      0.120978444814682,
      0.05331214517354965,
      0.07710713148117065,
      0.08887603133916855,
      0.11565033346414566,
      0.2515885531902313,
      0.06249674782156944,
      0.05570400878787041,
      0.05666988715529442,
      0.07767629623413086,
      0.08400622010231018,
      0.1302877813577652,
      0.14126557111740112,
      0.1717263162136078,
      0.18407602608203888,
      0.08481553196907043,
      0.0569816529750824,
      0.05208772420883179,
      0.06193813309073448,
      0.07666831463575363,
      0.12210269272327423,
      0.1626480221748352,
      0.20102447271347046,
      0.1724976748228073,
      0.11743344366550446,
      0.07979505509138107,
      0.08313591033220291,
      0.10019537806510925,
      0.11426877975463867,
      0.1405080407857895,
      0.13802646100521088,
      0.15667802095413208,
      0.23345935344696045,
      0.056239403784275055,
      0.051072798669338226,
      0.05254402384161949,
      0.07337110489606857,
      0.07969272136688232,
      0.12117648124694824,
      0.1257358342409134,
      0.15905696153640747,
      0.2188757061958313,
      0.062328118830919266,
      0.04631238803267479,
      0.055489152669906616,
      0.08361112326383591,
      0.10877823084592819,
      0.14511869847774506,
      0.11937379837036133,
      0.11824536323547363,
      0.1804204136133194,
      0.12751327455043793,
      0.08201418817043304,
      0.0847514420747757,
      0.10245651006698608,
      0.11477582901716232,
      0.13976839184761047,
      0.1385912150144577,
      0.1651071012020111,
      0.15325389802455902,
      0.10120362788438797,
      0.09961133450269699,
      0.138090580701828,
      0.16906532645225525,
      0.16031964123249054,
      0.12204471230506897,
      0.0903196781873703,
      0.109687440097332,
      0.22778445482254028,
      0.06827184557914734,
      0.048131924122571945,
      0.05615502968430519,
      0.08457796275615692,
      0.10985157638788223,
      0.14130476117134094,
      0.11747535318136215,
      0.12387865781784058,
      0.2009064257144928,
      0.07181950658559799,
      0.06639871001243591,
      0.09094880521297455,
      0.12171705067157745,
      0.12160852551460266,
      0.10722239315509796,
      0.0795949175953865,
      0.07664724439382553,
      0.156973734498024,
      0.11239495873451233,
      0.1000615656375885,
      0.13969752192497253,
      0.1703731268644333,
      0.15753091871738434,
      0.12012156844139099,
      0.09132745116949081,
      0.1223796159029007,
      0.14723215997219086,
      0.09142924100160599,
      0.12334384769201279,
      0.1630408614873886,
      0.17443718016147614,
      0.13609880208969116,
      0.09654217958450317,
      0.10360485315322876,
      0.13754607737064362,
      0.2050323188304901,
      0.08572201430797577,
      0.06821040064096451,
      0.08987683057785034,
      0.11913236975669861,
      0.11816424131393433,
      0.10373083502054214,
      0.08027675002813339,
      0.08309369534254074,
      0.19164730608463287,
      0.0793195366859436,
      0.1028812900185585,
      0.1203802078962326,
      0.12612485885620117,
      0.09352923929691315,
      0.06574766337871552,
      0.0772707387804985,
      0.09846672415733337,
      0.1355845332145691,
      0.09146339446306229,
      0.12583038210868835,
      0.16567912697792053,
      0.17453496158123016,
      0.13554973900318146,
      0.09716123342514038,
      0.09982621669769287,
      0.1332917958498001,
      0.17040039598941803,
      0.1422853022813797,
      0.14102232456207275,
      0.1226460263133049,
      0.11081892251968384,
      0.092325359582901,
      0.08724042028188705,
      0.12474968284368515,
      0.15924251079559326,
      0.19155661761760712,
      0.08043202012777328,
      0.1067107766866684,
      0.12417464703321457,
      0.1287875771522522,
      0.09486198425292969,
      0.06563700735569,
      0.0735430046916008,
      0.096158966422081,
      0.2214602530002594,
      0.11833605915307999,
      0.1407989114522934,
      0.11067727208137512,
      0.08729758113622665,
      0.05751435458660126,
      0.04774682968854904,
